<a href="https://colab.research.google.com/github/krsna540/Hackthons/blob/master/HRAnalytics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt # for data visualization
import seaborn as sns # for heatmap plot
# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory
# Suppressing Warnings
import warnings
warnings.filterwarnings('ignore')

In [31]:
trainData = pd.read_csv("train_LZdllcl.csv")
testData=pd.read_csv("test_2umaH9m.csv")
print(trainData.shape)
print(testData.shape)

(54808, 14)
(23490, 13)

In [32]:
trainData.isnull().any().sum()

2

In [0]:
trainData.fillna(0, inplace = True)

In [34]:
trainData.head()

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

In [0]:
from numpy import array
from numpy import argmax
from keras.utils import to_categorical

In [0]:
trainData['region'] = trainData['region'].map(lambda x: int(x.lstrip('region_')))
Gender = {'m': 1,'f': 0}
trainData.gender = [Gender[item] for item in trainData.gender]
trainData = pd.get_dummies(trainData, columns = ['recruitment_channel', 'department', 'education'], drop_first = True)

In [37]:
trainData.head()

   employee_id  region  ...  education_Below Secondary  education_Master's & above
0        65438       7  ...                          0                           1
1        65141      22  ...                          0                           0
2         7513      19  ...                          0                           0
3         2542      23  ...                          0                           0
4        48945      26  ...                          0                           0

[5 rows x 24 columns]

In [38]:
testData.head()

   employee_id         department  ... awards_won? avg_training_score
0         8724         Technology  ...           0                 77
1        74430                 HR  ...           0                 51
2        72255  Sales & Marketing  ...           0                 47
3        38562        Procurement  ...           0                 65
4        64486            Finance  ...           0                 61

[5 rows x 13 columns]

In [0]:
testData['region'] = testData['region'].map(lambda x: int(x.lstrip('region_')))
Gender = {'m': 1,'f': 0}
testData.gender = [Gender[item] for item in testData.gender]
testData = pd.get_dummies(testData, columns = ['recruitment_channel', 'department', 'education'], drop_first = True)

In [40]:
testData.head()

   employee_id  region  ...  education_Below Secondary  education_Master's & above
0         8724      26  ...                          0                           0
1        74430       4  ...                          0                           0
2        72255      13  ...                          0                           0
3        38562       2  ...                          0                           0
4        64486      29  ...                          0                           0

[5 rows x 22 columns]

In [0]:
trainData=trainData.drop(['employee_id'],axis=1)
train_x=trainData.drop(['is_promoted'],axis=1)
train_y=trainData['is_promoted']

In [42]:
trainData.shape

(54808, 23)

In [0]:
#Removing special charecters from column names
trainData.columns = trainData.columns.str.strip().str.lower().str.replace('>', '').str.replace('?', '').str.replace('%', '').str.replace(' ', '')

In [46]:
from sklearn.feature_selection import SelectKBest
from sklearn.feature_selection import chi2

X = trainData.drop(['is_promoted'],axis=1)
y = trainData['is_promoted']
#apply SelectKBest class to extract top 10 best features
bestfeatures = SelectKBest(score_func=chi2, k=10)
fit = bestfeatures.fit(X,y)
dfscores = pd.DataFrame(fit.scores_)
dfcolumns = pd.DataFrame(X.columns)
#concat two dataframes for better visualization 
featureScores = pd.concat([dfcolumns,dfscores],axis=1)
featureScores.columns = ['Specs','Score']  #naming the dataframe columns
print(featureScores.nlargest(15,'Score'))  #print 10 best features

                           Specs        Score
8             avg_training_score  5072.973743
7                     awards_won  2054.009313
6                     kpis_met80  1743.827117
4           previous_year_rating   632.801485
0                         region    47.589009
18         department_technology    46.061828
17    department_sales&marketing    37.312181
21      education_master's&above    34.340794
3                            age    27.228103
12                 department_hr    25.964640
5              length_of_service    19.351084
9   recruitment_channel_referred    18.649158
13              department_legal    15.560025
15        department_procurement    11.523545
2                no_of_trainings    10.063491